; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v11 ?v9)
             (pred_5 ?v5 ?v6)
             (pred_11 ?v11 ?v6)
             (pred_3 ?v13 ?v11 )
	     (pred_6 ?v11)
             (pred_8 ?v2)
             (pred_2 ?v5)
             (pred_1 ?v6)
             (pred_7 ?v11)
             (pred_10 ?v5)
             (pred_4 ?v11)
             (pred_9 ))



(:action op_5
:parameters (?v8 ?v4 ?v12 ?v10)
:precondition (and (pred_8 ?v8) (pred_8 ?v4) (pred_2 ?v12) (pred_1 ?v10)
          (pred_12 ?v8 ?v4) (pred_5 ?v12 ?v10)
                   (pred_11 ?v4 ?v10) (pred_6 ?v8) 
                   (pred_7 ?v4) (pred_10 ?v12))
:effect (and  (pred_4 ?v4) (not (pred_7 ?v4))))


(:action op_3
:parameters (?v8 ?v7)
:precondition (and (pred_8 ?v8) (pred_8 ?v7)
               (pred_6 ?v8) (pred_12 ?v8 ?v7) (pred_4 ?v7))
:effect (and (pred_6 ?v7) (not (pred_6 ?v8))))

(:action op_4
:parameters (?v8 ?v12)
:precondition (and (pred_8 ?v8) (pred_2 ?v12) 
                  (pred_6 ?v8) (pred_3 ?v12 ?v8) (pred_9 ))
:effect (and (pred_10 ?v12)
   (not (pred_3 ?v12 ?v8)) (not (pred_9 ))))


(:action op_1
:parameters (?v8 ?v3 ?v1)
:precondition (and (pred_8 ?v8) (pred_2 ?v3) (pred_2 ?v1)
                  (pred_6 ?v8) (pred_10 ?v1) (pred_3 ?v3 ?v8))
:effect (and (pred_10 ?v3) (pred_3 ?v1 ?v8)
        (not (pred_10 ?v1)) (not (pred_3 ?v3 ?v8))))

(:action op_2
:parameters (?v8 ?v12)
:precondition (and (pred_8 ?v8) (pred_2 ?v12) 
                  (pred_6 ?v8) (pred_10 ?v12))
:effect (and (pred_9 ) (pred_3 ?v12 ?v8) (not (pred_10 ?v12)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_01 obj_08 obj_12 obj_15 obj_14 obj_05 obj_21 obj_04 obj_09 obj_13 obj_19 obj_16 obj_02 obj_20 obj_11 obj_06
    obj_22 obj_17 obj_10
    obj_07 obj_18 obj_03
    )

    (:init
       (pred_9)

       (pred_8 obj_01)
       (pred_8 obj_08)
       (pred_8 obj_12)
       (pred_8 obj_15)
       (pred_8 obj_14)
       (pred_8 obj_05)
       (pred_8 obj_21)
       (pred_8 obj_04)
       (pred_8 obj_09)
       (pred_8 obj_13)
       (pred_8 obj_19)
       (pred_8 obj_16)
       (pred_8 obj_02)
       (pred_8 obj_20)
       (pred_8 obj_11)
       (pred_8 obj_06)
       (pred_1 obj_22)
       (pred_1 obj_17)
       (pred_1 obj_10)
       (pred_2 obj_07)
       (pred_2 obj_18)
       (pred_2 obj_03)

       (pred_12 obj_01 obj_14)
       (pred_12 obj_01 obj_08)
       (pred_12 obj_08 obj_05)
       (pred_12 obj_08 obj_12)
       (pred_12 obj_08 obj_01)
       (pred_12 obj_12 obj_21)
       (pred_12 obj_12 obj_15)
       (pred_12 obj_12 obj_08)
       (pred_12 obj_15 obj_04)
       (pred_12 obj_15 obj_12)
       (pred_12 obj_14 obj_09)
       (pred_12 obj_14 obj_05)
       (pred_12 obj_14 obj_01)
       (pred_12 obj_05 obj_13)
       (pred_12 obj_05 obj_21)
       (pred_12 obj_05 obj_08)
       (pred_12 obj_05 obj_14)
       (pred_12 obj_21 obj_19)
       (pred_12 obj_21 obj_04)
       (pred_12 obj_21 obj_12)
       (pred_12 obj_21 obj_05)
       (pred_12 obj_04 obj_16)
       (pred_12 obj_04 obj_15)
       (pred_12 obj_04 obj_21)
       (pred_12 obj_09 obj_02)
       (pred_12 obj_09 obj_13)
       (pred_12 obj_09 obj_14)
       (pred_12 obj_13 obj_20)
       (pred_12 obj_13 obj_19)
       (pred_12 obj_13 obj_05)
       (pred_12 obj_13 obj_09)
       (pred_12 obj_19 obj_11)
       (pred_12 obj_19 obj_16)
       (pred_12 obj_19 obj_21)
       (pred_12 obj_19 obj_13)
       (pred_12 obj_16 obj_06)
       (pred_12 obj_16 obj_04)
       (pred_12 obj_16 obj_19)
       (pred_12 obj_02 obj_20)
       (pred_12 obj_02 obj_09)
       (pred_12 obj_20 obj_11)
       (pred_12 obj_20 obj_13)
       (pred_12 obj_20 obj_02)
       (pred_12 obj_11 obj_06)
       (pred_12 obj_11 obj_19)
       (pred_12 obj_11 obj_20)
       (pred_12 obj_06 obj_16)
       (pred_12 obj_06 obj_11)
       (pred_7 obj_02)
       (pred_7 obj_08)
       (pred_7 obj_06)
       (pred_11  obj_02 obj_22)
       (pred_11  obj_08 obj_17)
       (pred_11  obj_06 obj_10)
       (pred_4 obj_01)
       (pred_4 obj_12)
       (pred_4 obj_15)
       (pred_4 obj_14)
       (pred_4 obj_05)
       (pred_4 obj_21)
       (pred_4 obj_04)
       (pred_4 obj_09)
       (pred_4 obj_13)
       (pred_4 obj_19)
       (pred_4 obj_16)
       (pred_4 obj_20)
       (pred_4 obj_11)

       (pred_5  obj_07 obj_22)
       (pred_5  obj_18 obj_17)
       (pred_5  obj_03 obj_10)
       (pred_3 obj_07 obj_14)
       (pred_3 obj_18 obj_21)
       (pred_3 obj_03 obj_13)
       (pred_6 obj_20)
    )

    (:goal (and
       (pred_3 obj_18 obj_14)
    ))
(:constraints
  (always (not (pred_6 obj_05)))
)
)

; plan
1. (op_3 obj_20 obj_13)
   deleted: (pred_6 obj_20)
   added: (pred_6 obj_13)
   goals met: 0 of 1
2. (op_3 obj_13 obj_19)
   deleted: (pred_6 obj_13)
   added: (pred_6 obj_19)
   goals met: 0 of 1
3. (op_3 obj_19 obj_21)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_21)
   goals met: 0 of 1
4. (op_4 obj_21 obj_18)
   deleted: (pred_3 obj_18 obj_21) (pred_9)
   added: (pred_10 obj_18)
   goals met: 0 of 1
5. (op_3 obj_21 obj_19)
   deleted: (pred_6 obj_21)
   added: (pred_6 obj_19)
   goals met: 0 of 1
6. (op_3 obj_19 obj_13)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_13)
   goals met: 0 of 1
7. (op_3 obj_13 obj_09)
   deleted: (pred_6 obj_13)
   added: (pred_6 obj_09)
   goals met: 0 of 1
8. (op_3 obj_09 obj_14)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_14)
   goals met: 0 of 1
9. (op_1 obj_14 obj_07 obj_18)
   deleted: (pred_10 obj_18) (pred_3 obj_07 obj_14)
   added: (pred_10 obj_07) (pred_3 obj_18 obj_14)
   goals met: 1 of 1
